In [40]:
import os
import pandas as pd
from sqlalchemy import create_engine

In [41]:
# csv_file = "../Data/movies_db_1.csv"
file = '../Data/movies_db.csv'
df = pd.read_csv(file, error_bad_lines=False)
df.head()

,_id,title,year
0,"ObjectId(""5d5ed05284296f90ef7989fe"")",Glass,2019
1,"ObjectId(""5d5ed05284296f90ef7989ff"")",The Kid Who Would Be King,2019
2,"ObjectId(""5d5ed05284296f90ef798a00"")",Miss Bala,2019
3,"ObjectId(""5d5ed05284296f90ef798a01"")",The Lego Movie 2: The Second Part,2019
4,"ObjectId(""5d5ed05284296f90ef798a02"")",What Men Want,2019

In [42]:
import my_functions as nv

In [43]:
df['_id'] = df['_id'].map(nv.const_cleanup)

In [44]:
df.head()

                        _id                              title  year
0  5d5ed05284296f90ef7989fe                              Glass  2019
1  5d5ed05284296f90ef7989ff          The Kid Who Would Be King  2019
2  5d5ed05284296f90ef798a00                          Miss Bala  2019
3  5d5ed05284296f90ef798a01  The Lego Movie 2: The Second Part  2019
4  5d5ed05284296f90ef798a02                      What Men Want  2019

In [25]:
from dbconfig import user_id, user_pwd

In [33]:
rds_connection_string = f"{user_id}:{user_pwd}@localhost:5432/movies_db"
#print(rds_connection_string)
engine = create_engine(f'postgresql://{rds_connection_string}')

In [34]:
engine.table_names()

['movies']

In [35]:
df.to_sql(name='movies', con=engine, if_exists='append', index=False)

In [36]:
pd.read_sql_query('select * from movies', con=engine).head()

                        _id                              title  year
0  5d5ed05284296f90ef7989fe                              Glass  2019
1  5d5ed05284296f90ef7989ff          The Kid Who Would Be King  2019
2  5d5ed05284296f90ef798a00                          Miss Bala  2019
3  5d5ed05284296f90ef798a01  The Lego Movie 2: The Second Part  2019
4  5d5ed05284296f90ef798a02                      What Men Want  2019